print('Задача')
# Задача 2. Разминка для мозгов
#
# Напишите программу, которая проверяет то, как вы умеете складывать два числа в уме.
# Программа получает на вход два числа и предполагаемую сумму и должна выводить два разных сообщения — на верный и неверный ответ пользователя.
# В последнем случае надо показывать правильный результат.
#
# Пример:
#
# Введите первое число: 3
# Введите второе число: 10
# Сумма этих чисел: 13
# Ответ верный!
#
# Пример 2:
#
# Введите первое число: 3
# Введите второе число: 10
# Сумма этих чисел: 14
# Ответ неверный!

one_number = int(input('Первое число: '))
two_number = int(input('Второе число: '))
summ = int(input('Сумма этих чисел: '))
real_sum = one_number + two_number
if real_sum == summ:
    print('Верно')
else:
    print('Неверно. Правильный ответ', real_sum)
