print('Задача')

# Задача 3. Фальшивомонетчики
#
# Пете дали три монетки и сказали, что если он сможет на весах без гирь определить, какая из них фальшивая
# (более лёгкая), то сможет забрать их все. А Петя в одной из книжек прочитал, что для этого достаточно
# одного взвешивания: если две монеты весят одинаково, то фальшивая третья, а иначе фальшивая та, которая
# легче на весах. Напишите программу, которая принимает на вход вес трёх монет (две одинаковые, третья меньше)
# и определяет, какая из них легче.

a = int(input())
b = int(input())
c = int(input())
if a == b:
    print('c')
elif a > b:
    print('b')
else:
    print('a')
