print('Задача 1. Сбой')

# Задача 1. Сбой
#
# На предприятии произошло ЧП: что-то случилось с программным обеспечением, и производство встало. Когда стали разбираться, нашли битый кусок программы:
#
a = 6
b = 2
c = 0
if b < a:
    c = a * b
print(c)
#
#
# По задумке, здесь проверялись переменные а и b и в конце должен был выводиться ответ 12.
#
# Скопируйте программу в редактор, исправьте ошибки и вставьте необходимые значения вместо знаков вопроса. Проверьте работу программы.
#
#
