print('Задача 3. Угадай число')
# Задача 3. Угадай число

# Отец пообещал сыну отпустить его гулять, если тот с первого раза угадает число от 1 до 10, которое загадал папа. В противном случае сыну придётся весь день делать уроки.
# Напишите программу из урока, которая запрашивает число у пользователя (у сына), затем сравнивает его с другим числом (которое отец загадал), и если они равны, то выводит сообщение «Угадал». В конце вывести фразу: «Конец игры».

# Пример 1:
# Какое число я загадал? 5
# Угадал!
# Конец игры

# Пример 2:
# Какое число я загадал? 6
# Конец игры

# Попробуйте решить задачу сначала с помощью одного знака сравнения (==), а затем с помощью другого (!=). Во втором случае сообщение измените на «Не угадал».

dad_num = 5
son_num = int(input("Назови число: "))
if dad_num == son_num:
    print('Угадал!')

if dad_num != son_num:
    print('Не угадал!')

print('Конец игры')
