print('Задача 4. Площадь треугольника')

# Напишите программу,
# которая запрашивает у пользователя длины двух катетов
# в прямоугольном треугольнике и выводит его площадь.

# Формула:
# S = ab/2

first_leg = int(input('Введите длинну первого катета: '))
second_leg = int(input('введите длиннну второго катета: '))

print('Площадь треугольника равна:', first_leg * second_leg / 2)
