print('Задача 8. Режем число на части')

# Реализуйте программу,
# которая получает на вход четырёхзначное число
# и выводит на экран каждую его цифру отдельно
# (в одну строчку либо каждая цифра в новой строчке).
# Само число при этом изменять нельзя, то есть нужно обойтись без переприсваивания.
# Однако можно использовать сколько угодно переменных

number = int(input('Введите четырех значное число: '))
thousands = number % 1000
hundred = thousands % 100
tenths = hundred % 10

print(str(number // 1000), str(thousands // 100), str(hundred // 10), str(tenths))
