print(' Задача 2. Скидки!')
#
# Задача 2. Скидки!
#
# Напишите программу для примера, разобранного в уроке. Пользователь покупает курс стоимостью 75 000 рублей. Если денег на счету достаточно, то нужно:
#
#     Списать со счёта деньги.
#     Проверить баланс счёта. Если там меньше 5000 рублей, то зачислить на счёт 1000 рублей и вывести сообщение: «Сделана скидка».
#     Вывести сообщение: «Курс успешно приобретён».
#
# А иначе вывести: «Не хватает денег на счету». Также в конце вывести остаток счёта и сообщение: «Хорошего дня!»
#
#
# Пример:
#
# Сколько денег на счету? 78500
#
# Курс успешно приобретён
#
# Сделана скидка
#
# Остаток на счету: 4500
#
# Хорошего дня!
#

bank = int(input())

if bank > 75_000:
    print('ok')
    bank -= 75_000

    if bank < 5000:
        bank += 1000
print(bank)
