print('Задача')

# Задача 5. Модуль числа
#
#
# Что нужно сделать
#
# Математик Саша пишет программу, которая должна строить график функции y = |x|.
# Для этого ему нужно найти модуль очередного числа x,
# то есть если число x отрицательное, то перевести его в положительное.
#
# Напишите программу, которая выводит на экран модуль введённого числа.
#
#
# Пример:
#
# Ввели 5, ответ 5
#
# Ввели −7, ответ 7
#
#
# Подсказка: достаточно в некоторых случаях переприсвоить переменную со знаком минус.

a = int(input())
if a < 0:
    print(a * -1)
else:
    print(a)
