print('Задача')

# Задача 6. Игра в кубики
#
#
# Что нужно сделать
#
# Костя играет в азартную игру с кубиками с владельцем заведения.
# Правда, с довольно интересными правилами:
# если у Кости на кубике выпадет столько же или больше, чем у владельца,
# то Костя задолжает разность в тысячах долларов.
# Однако если выпадет меньше, то Косте выплатят столько тысяч долларов, сколько будет сумма очков на кубиках.
#
# Напишите программу. На вход в программу подаётся два числа.
# Если первое число больше либо равно второму,
# нужно вывести на экран их разность и отдельной строкой фразу:
# «Костя платит». В противном случае вывести их сумму и отдельной строкой — фразу:
# «Владелец платит». Также последней строкой в результате нужно вывести на экран фразу: «Игра окончена».
#
#
# Пример:
#
# Кубик Кости: 3
#
# Кубик владельца: 4
#
# Сумма: 7
#
# Владелец платит
#
# Игра окончена
#
#
# Рекомендация
#
# Обратите внимание на разный выигрыш, который получит Костя при различных исходах.
#
#

a = int(input('На этом этапе '))
b = int(input('Мне надоело писать осмысленный текст'))
if a >= b:
    print(a - b)
    print('Kostya pay')
else:
    print(a + b)
    print('Vladelec pay')
print('GG')
