print('Задача')
# Задача 4. Калькулятор скидки
#
#
# Что нужно сделать
#
# Андрей переехал в новую квартиру, и ему нужно купить три стула в разные комнаты.
# Естественно, цена на стулья в разных магазинах различается, а где-то ещё и скидка есть.
# Вот для одного из таких магазинов он и написал калькулятор скидки, чтобы проще ориентироваться в ценах.
#
# Напишите программу, которая запрашивает три стоимости товара и вычисляет сумму чека.
# Если сумма чека превышает 10 000 рублей,
# нужно вычесть из этой суммы скидку 10% (умножить на 10, разделить на 100). В конце вывести итоговую сумму на экран.
#
first = int(input('Стоимость первого товара: '))
second = int(input('Стоимость второго товара: '))
third = int(input('Стоимость третьего товара: '))

total = first + second + third
if total > 10_100:
    total *= 0.9

print(total)
